RetroBSD/retrobsd-early/sys/pic32/usb_device.c
/*
 * This file contains functions, macros, definitions, variables,
 * datatypes, etc. that are required for usage with the MCHPFSUSB device
 * stack. This file should be included in projects that use the device stack.
 *
 * The software supplied herewith by Microchip Technology Incorporated
 * (the 'Company') for its PIC® Microcontroller is intended and
 * supplied to you, the Company's customer, for use solely and
 * exclusively on Microchip PIC Microcontroller products. The
 * software is owned by the Company and/or its supplier, and is
 * protected under applicable copyright laws. All rights are reserved.
 * Any use in violation of the foregoing restrictions may subject the
 * user to criminal sanctions under applicable laws, as well as to
 * civil liability for the breach of the terms and conditions of this license.
 *
 * THIS SOFTWARE IS PROVIDED IN AN 'AS IS' CONDITION. NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 * IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 */
#include <sys/param.h>
#include <sys/systm.h>
#include <machine/pic32mx.h>
#include <machine/usb_device.h>

#if (USB_PING_PONG_MODE != USB_PING_PONG__FULL_PING_PONG)
    #error "PIC32 only supports full ping pong mode."
#endif

USB_VOLATILE unsigned char usb_device_state;
USB_VOLATILE unsigned char usb_active_configuration;
static USB_VOLATILE unsigned char usb_alternate_interface[USB_MAX_NUM_INT];
static volatile BDT_ENTRY *pBDTEntryEP0OutCurrent;
static volatile BDT_ENTRY *pBDTEntryEP0OutNext;
static volatile BDT_ENTRY *pBDTEntryOut[USB_MAX_EP_NUMBER+1];
static volatile BDT_ENTRY *pBDTEntryIn[USB_MAX_EP_NUMBER+1];
static USB_VOLATILE unsigned char short_packet_status;
static USB_VOLATILE unsigned char control_transfer_state;
static USB_VOLATILE unsigned char ustat_saved;
USB_VOLATILE IN_PIPE usb_in_pipe[1];
USB_VOLATILE OUT_PIPE usb_out_pipe[1];
USB_VOLATILE int usb_remote_wakeup;

/*
 * Section A: Buffer Descriptor Table
 * - 0x400 - 0x4FF(max)
 * - USB_MAX_EP_NUMBER is defined in target.cfg
 */
volatile BDT_ENTRY usb_buffer [(USB_MAX_EP_NUMBER + 1) * 4] __attribute__ ((aligned (512)));

/*
 * Section B: EP0 Buffer Space
 */
volatile CTRL_TRF_SETUP usb_setup_pkt;           // 8-byte only

// Buffer for control transfer data
static volatile unsigned char ctrl_trf_data [USB_EP0_BUFF_SIZE];

/*
 * This function initializes the device stack
 * it in the default state
 *
 * The USB module will be completely reset including
 * all of the internal variables, registers, and
 * interrupt flags.
 */
void usb_device_init(void)
{
    unsigned char i;

    // Clear all USB error flags
    U1EIR = 0xFF;

    // Clears all USB interrupts
    U1IR = 0xFF;

    U1EIE = 0x9F;                   // Unmask all USB error interrupts
    U1IE = 0xFB;                    // Enable all interrupts except ACTIVE

    // Power up the module
    U1PWRC |= PIC32_U1PWRC_USBPWR;

    // Set the address of the BDT (if applicable)
    U1BDTP1 = (unsigned) usb_buffer >> 8;

    // Reset all of the Ping Pong buffers
    U1CON |= PIC32_U1CON_PPBRST;
    U1CON &= ~PIC32_U1CON_PPBRST;

    // Reset to default address
    U1ADDR = 0x00;

    // Clear all of the endpoint control registers
    bzero((void*) &U1EP1, USB_MAX_EP_NUMBER - 1);

    // Clear all of the BDT entries
    for (i=0; i<(sizeof(usb_buffer)/sizeof(BDT_ENTRY)); i++) {
       usb_buffer[i].Val = 0x00;
    }

    // Initialize EP0 as a Ctrl EP
    U1EP0 = EP_CTRL | USB_HANDSHAKE_ENABLED;

    // Flush any pending transactions
    while (USBTransactionCompleteIF) {
        *USBTransactionCompleteIFReg = 1 << USBTransactionCompleteIFBitNum;
    }

    //clear all of the internal pipe information
    usb_in_pipe[0].info.Val = 0;
    usb_out_pipe[0].info.Val = 0;
    usb_out_pipe[0].wCount = 0;

    // Make sure packet processing is enabled
    U1CON &= ~PIC32_U1CON_PKTDIS;

    // Get ready for the first packet
    pBDTEntryIn[0] = (volatile BDT_ENTRY*) &usb_buffer[EP0_IN_EVEN];

    // Clear active configuration
    usb_active_configuration = 0;

    // Indicate that we are now in the detached state
    usb_device_state = DETACHED_STATE;
}

/*
 * This function is the main state machine of the
 * USB device side stack.  This function should be
 * called periodically to receive and transmit
 * packets through the stack.  This function should
 * be called  preferably once every 100us
 * during the enumeration process.  After the
 * enumeration process this function still needs to
 * be called periodically to respond to various
 * situations on the bus but is more relaxed in its
 * time requirements.  This function should also
 * be called at least as fast as the OUT data
 * expected from the PC.
 */
void usb_device_tasks(void)
{
    unsigned char i;

#ifdef USB_SUPPORT_OTG
    // SRP Time Out Check
    if (USBOTGSRPIsReady())
    {
        if (USBT1MSECIF && USBT1MSECIE)
        {
            if (USBOTGGetSRPTimeOutFlag())
            {
                if (USBOTGIsSRPTimeOutExpired())
                {
                    USB_OTGEventHandler(0,OTG_EVENT_SRP_FAILED,0,0);
                }
            }
            // Clear Interrupt Flag
            *USBT1MSECIFReg = 1 << USBT1MSECIFBitNum;
        }
    }
    // If Session Is Started Then
    else {
        // If SRP Is Ready
        if (USBOTGSRPIsReady())
        {
            // Clear SRPReady
            USBOTGClearSRPReady();

            // Clear SRP Timeout Flag
            USBOTGClearSRPTimeOutFlag();

            // Indicate Session Started
            UART2PrintString( "\r\n***** USB OTG B Event - Session Started  *****\r\n" );
        }
    }
#endif

    // if we are in the detached state
    if (usb_device_state == DETACHED_STATE)
    {
	// Disable module & detach from bus
        U1CON = 0;

        // Mask all USB interrupts
        U1IE = 0;

        // Enable module & attach to bus
        while (! (U1CON & PIC32_U1CON_USBEN)) {
		U1CON |= PIC32_U1CON_USBEN;
	}

