RetroBSD/retrobsd-early/sys/pic32/usb_device.c
        // moved to the attached state
        usb_device_state = ATTACHED_STATE;

        // Enable/set things like: pull ups, full/low-speed mode,
        // set the ping pong mode, and set internal transceiver
        SetConfigurationOptions();

#ifdef USB_SUPPORT_OTG
	U1OTGCON = USB_OTG_DPLUS_ENABLE | USB_OTG_ENABLE;
#endif
    }

    if (usb_device_state == ATTACHED_STATE) {
        /*
         * After enabling the USB module, it takes some time for the
         * voltage on the D+ or D- line to rise high enough to get out
         * of the SE0 condition. The USB Reset interrupt should not be
         * unmasked until the SE0 condition is cleared. This helps
         * prevent the firmware from misinterpreting this unique event
         * as a USB bus reset from the USB host.
         */
        U1IR = 0;			// Clear all USB interrupts
        U1IE = 0;			// Mask all USB interrupts
	U1IE |= PIC32_U1I_URST |	// Unmask RESET interrupt
		PIC32_U1I_IDLE;		// Unmask IDLE interrupt
	usb_device_state = POWERED_STATE;
    }

#ifdef USB_SUPPORT_OTG
    // If ID Pin Changed State
    if (USBIDIF && USBIDIE)
    {
        // Re-detect & Initialize
        USBOTGInitialize();

        *USBIDIFReg = 1 << USBIDIFBitNum;
    }
#endif

    /*
     * Task A: Service USB Activity Interrupt
     */
    if (USBActivityIF && USBActivityIE)
    {
#if defined(USB_SUPPORT_OTG)
        *USBActivityIFReg = 1 << USBActivityIFBitNum;
        U1OTGIR = 0x10;
#else
        usb_wake_from_suspend();
#endif
    }

    /*
     * Pointless to continue servicing if the device is in suspend mode.
     */
    if (U1PWRC & PIC32_U1PWRC_USUSPEND) {
        return;
    }

    /*
     * Task B: Service USB Bus Reset Interrupt.
     * When bus reset is received during suspend, ACTVIF will be set first,
     * once the UCON_SUSPND is clear, then the URSTIF bit will be asserted.
     * This is why URSTIF is checked after ACTVIF.
     *
     * The USB reset flag is masked when the USB state is in
     * DETACHED_STATE or ATTACHED_STATE, and therefore cannot
     * cause a USB reset event during these two states.
     */
    if (USBResetIF && USBResetIE)
    {
        usb_device_init();
        usb_device_state = DEFAULT_STATE;

        /*
         * Bug Fix: Feb 26, 2007 v2.1 (#F1)
         *********************************************************************
         * In the original firmware, if an OUT token is sent by the host
         * before a SETUP token is sent, the firmware would respond with an ACK.
         * This is not a correct response, the firmware should have sent a STALL.
         * This is a minor non-compliance since a compliant host should not
         * send an OUT before sending a SETUP token. The fix allows a SETUP
         * transaction to be accepted while stalling OUT transactions.
         * */
        usb_buffer[EP0_OUT_EVEN].ADR = ConvertToPhysicalAddress (&usb_setup_pkt);
        usb_buffer[EP0_OUT_EVEN].CNT = USB_EP0_BUFF_SIZE;
        usb_buffer[EP0_OUT_EVEN].STAT.Val &= ~_STAT_MASK;
        usb_buffer[EP0_OUT_EVEN].STAT.Val |= _USIE|_DAT0|_DTSEN|_BSTALL;

#ifdef USB_SUPPORT_OTG
         // Disable HNP
         USBOTGDisableHnp();

         // Deactivate HNP
         USBOTGDeactivateHnp();
#endif
    }

    /*
     * Task C: Service other USB interrupts
     */
    if (USBIdleIF && USBIdleIE)
    {
#ifdef USB_SUPPORT_OTG
        // If Suspended, Try to switch to Host
        USBOTGSelectRole(ROLE_HOST);
#else
        usb_suspend();
#endif
        *USBIdleIFReg = 1 << USBIdleIFBitNum;
    }

    if (USBSOFIF && USBSOFIE)
    {
        usbcb_sof_handler();    // Required callback, see usbcallbacks.c
        *USBSOFIFReg = 1 << USBSOFIFBitNum;
    }

    if (USBStallIF && USBStallIE)
    {
        usb_stall_handler();
    }

    if (USBErrorIF && USBErrorIE)
    {
        usbcb_error_handler();  // Required callback, see usbcallbacks.c
        U1EIR = 0xFF;           // This clears UERRIF
    }

    /*
     * Pointless to continue servicing if the host has not sent a bus reset.
     * Once bus reset is received, the device transitions into the DEFAULT
     * state and is ready for communication.
     */
    if (usb_device_state < DEFAULT_STATE)
        return;

    /*
     * Task D: Servicing USB Transaction Complete Interrupt
     */
    if (USBTransactionCompleteIE)
    {
        // Drain or deplete the USAT FIFO entries.
        // If the USB FIFO ever gets full, USB bandwidth
        // utilization can be compromised, and the device
        // won't be able to receive SETUP packets.
	for (i = 0; i < 4; i++) {
	    if (! USBTransactionCompleteIF)
	    	break;                      // USTAT FIFO must be empty.

            ustat_saved = U1STAT;
            *USBTransactionCompleteIFReg = 1 << USBTransactionCompleteIFBitNum;

            /*
             * usb_ctrl_ep_service only services transactions over EP0.
             * It ignores all other EP transactions.
             */
            usb_ctrl_ep_service();
        }
    }
}

/*
 * This function handles the event of a STALL occuring on the bus
 */
void usb_stall_handler(void)
{
    /*
     * Does not really have to do anything here,
     * even for the control endpoint.
     * All BDs of Endpoint 0 are owned by SIE right now,
     * but once a Setup Transaction is received, the ownership
     * for EP0_OUT will be returned to CPU.
     * When the Setup Transaction is serviced, the ownership
     * for EP0_IN will then be forced back to CPU by firmware.
     */

    /* v2b fix */
    if (U1EP0 & PIC32_U1EP_EPSTALL)
    {
        // UOWN - if 0, owned by CPU, if 1, owned by SIE
        if ((pBDTEntryEP0OutCurrent->STAT.Val == _USIE) && (pBDTEntryIn[0]->STAT.Val == (_USIE|_BSTALL)))
        {
            // Set ep0Bo to stall also
            pBDTEntryEP0OutCurrent->STAT.Val = _USIE|_DAT0|_DTSEN|_BSTALL;
        }
	// Clear stall status
	U1EP0 &= ~PIC32_U1EP_EPSTALL;
    }//end if

    *USBStallIFReg = 1 << USBStallIFBitNum;
}

/*
 * This function handles if the host tries to suspend the device
 */
void usb_suspend(void)
{
    /*
     * NOTE: Do not clear UIR_ACTVIF here!
     * Reason:
     * ACTVIF is only generated once an IDLEIF has been generated.
     * This is a 1:1 ratio interrupt generation.
     * For every IDLEIF, there will be only one ACTVIF regardless of
     * the number of subsequent bus transitions.
     *
     * If the ACTIF is cleared here, a problem could occur when:
     * [       IDLE       ][bus activity ->
     * <--- 3 ms ----->     ^
     *                ^     ACTVIF=1
     *                IDLEIF=1
     *  #           #           #           #   (#=Program polling flags)
     *                          ^
     *                          This polling loop will see both
     *                          IDLEIF=1 and ACTVIF=1.
     *                          However, the program services IDLEIF first
     *                          because ACTIVIE=0.
     *                          If this routine clears the only ACTIVIF,
     *                          then it can never get out of the suspend
     *                          mode.
     */

