RetroBSD/retrobsd-early/sys/pic32/usb_device.c
        /* v2b fix */
        if (short_packet_status == SHORT_PKT_SENT)
        {
            // If a short packet has been sent, don't want to send any more,
            // stall next time if host is still trying to read.
            pBDTEntryIn[0]->STAT.Val = _USIE|_BSTALL;
        } else {
            if (lastDTS == 0) {
                pBDTEntryIn[0]->STAT.Val = _USIE|_DAT1|_DTSEN;
            } else {
                pBDTEntryIn[0]->STAT.Val = _USIE|_DAT0|_DTSEN;
            }
        }
    } else {
        // CTRL_TRF_RX
        usb_prepare_for_next_setup_trf();
    }
}

/*
 * The routine forces EP0 OUT to be ready for a new
 * Setup transaction, and forces EP0 IN to be owned by CPU.
 */
void usb_prepare_for_next_setup_trf(void)
{
    /*
    Bug Fix: Feb 26, 2007 v2.1
    *********************************************************************
    Facts:
    A Setup Packet should never be stalled. (USB 2.0 Section 8.5.3)
    If a Setup PID is detected by the SIE, the DTSEN setting is ignored.
    This causes a problem at the end of a control write transaction.
    In usb_ctrl_ep_service_complete(), during a control write (Host to Device),
    the EP0_OUT is setup to write any data to the ctrl_trf_data buffer.
    If <SETUP[0]><IN[1]> is completed and usb_ctrl_trf_in_handler() is not
    called before the next <SETUP[0]> is received, then the latest Setup
    data will be written to the ctrl_trf_data buffer instead of the usb_setup_pkt
    buffer.

    If usb_ctrl_trf_in_handler() was called before the latest <SETUP[0]> is
    received, then there would be no problem,
    because usb_prepare_for_next_setup_trf() would have been called and updated
    ep0Bo.ADR to point to the usb_setup_pkt buffer.

    Work around:
    Check for the problem as described above and copy the Setup data from
    ctrl_trf_data to usb_setup_pkt.
    */
    if ((control_transfer_state == CTRL_TRF_RX) &&
       (U1CON & PIC32_U1CON_PKTDIS) &&
       (pBDTEntryEP0OutCurrent->CNT == sizeof(CTRL_TRF_SETUP)) &&
       (pBDTEntryEP0OutCurrent->STAT.PID == SETUP_TOKEN) &&
       (pBDTEntryEP0OutNext->STAT.UOWN == 0))
    {
        unsigned char setup_cnt;

        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&usb_setup_pkt);

        // The Setup data was written to the ctrl_trf_data buffer, must copy
        // it back to the usb_setup_pkt buffer so that it can be processed correctly
        // by usb_ctrl_trf_setup_handler().
        for(setup_cnt = 0; setup_cnt < sizeof(CTRL_TRF_SETUP); setup_cnt++)
        {
            *(((unsigned char*) &usb_setup_pkt) + setup_cnt) =
                *(((unsigned char*) &ctrl_trf_data) + setup_cnt);
        }
    /* End v3b fix */
    } else {
        control_transfer_state = WAIT_SETUP;
        pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;      // Defined in target.cfg
        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&usb_setup_pkt);

        /*
        Bug Fix: Feb 26, 2007 v2.1 (#F1)
        *********************************************************************
        In the original firmware, if an OUT token is sent by the host
        before a SETUP token is sent, the firmware would respond with an ACK.
        This is not a correct response, the firmware should have sent a STALL.
        This is a minor non-compliance since a compliant host should not
        send an OUT before sending a SETUP token. The fix allows a SETUP
        transaction to be accepted while stalling OUT transactions.
        */
        //ep0Bo.Stat.Val = _USIE|_DAT0|_DTSEN;        // Removed
        pBDTEntryEP0OutNext->STAT.Val = _USIE|_DAT0|_DTSEN|_BSTALL;  //Added #F1

        /*
        Bug Fix: Feb 26, 2007 v2.1 (#F3)
        *********************************************************************
        In the original firmware, if an IN token is sent by the host
        before a SETUP token is sent, the firmware would respond with an ACK.
        This is not a correct response, the firmware should have sent a STALL.
        This is a minor non-compliance since a compliant host should not
        send an IN before sending a SETUP token.

        Comment why this fix (#F3) is interfering with fix (#AF1).
        */
        pBDTEntryIn[0]->STAT.Val = _UCPU;             // Should be removed

        {
            BDT_ENTRY* p;

            p = (BDT_ENTRY*)(((unsigned int)pBDTEntryIn[0])^USB_NEXT_EP0_IN_PING_PONG);
            p->STAT.Val = _UCPU;
        }

        //ep0Bi.Stat.Val = _USIE|_BSTALL;   // Should be added #F3
    }

    //if someone is still expecting data from the control transfer
    //  then make sure to terminate that request and let them know that
    //  they are done
    if (usb_out_pipe[0].info.bits.busy == 1) {
        if (usb_out_pipe[0].pFunc != 0) {
            usb_out_pipe[0].pFunc();
        }
        usb_out_pipe[0].info.bits.busy = 0;
    }

}//end usb_prepare_for_next_setup_trf

/*
 * This routine checks the setup data packet to see
 * if it knows how to handle it
 */
void usb_check_std_request(void)
{
    if (usb_setup_pkt.RequestType != STANDARD) return;

    switch (usb_setup_pkt.bRequest) {
    case SET_ADR:
        usb_in_pipe[0].info.bits.busy = 1;            // This will generate a zero length packet
        usb_device_state = ADR_PENDING_STATE;     // Update state only
        /* See usb_ctrl_trf_in_handler() for the next step */
        break;
    case GET_DSC:
        usb_std_get_dsc_handler();
        break;
    case SET_CFG:
        usb_std_set_cfg_handler();
        break;
    case GET_CFG:
        usb_in_pipe[0].pSrc.bRam = (unsigned char*)&usb_active_configuration;	// Set Source
        usb_in_pipe[0].info.bits.ctrl_trf_mem = _RAM;			// Set memory type
        usb_in_pipe[0].wCount |= 0xff;					// Set data count
        usb_in_pipe[0].info.bits.busy = 1;
        break;
    case GET_STATUS:
        usb_std_get_status_handler();
        break;
    case CLR_FEATURE:
    case SET_FEATURE:
        usb_std_feature_req_handler();
        break;
    case GET_INTF:
        usb_in_pipe[0].pSrc.bRam = (unsigned char*)&usb_alternate_interface +
            usb_setup_pkt.bIntfID;				// Set source
        usb_in_pipe[0].info.bits.ctrl_trf_mem = _RAM;		// Set memory type
        usb_in_pipe[0].wCount |= 0xff;				// Set data count
        usb_in_pipe[0].info.bits.busy = 1;
        break;
    case SET_INTF:
        usb_in_pipe[0].info.bits.busy = 1;
        usb_alternate_interface[usb_setup_pkt.bIntfID] = usb_setup_pkt.bAltID;
        break;
    case SET_DSC:
        usbcb_std_set_dsc_handler();
        break;
    case SYNCH_FRAME:
    default:
        break;
    }
}

