RetroBSD/retrobsd-early/sys/pic32/usb_device.c
/*
 * This routine handles the standard SET & CLEAR
 * FEATURES requests
 */
void usb_std_feature_req_handler(void)
{
    BDT_ENTRY *p;
    unsigned int *pUEP;

#ifdef	USB_SUPPORT_OTG
    if ((usb_setup_pkt.bFeature == OTG_FEATURE_B_HNP_ENABLE)&&
        (usb_setup_pkt.Recipient == RCPT_DEV))
    {
        usb_in_pipe[0].info.bits.busy = 1;
        if (usb_setup_pkt.bRequest == SET_FEATURE)
            USBOTGEnableHnp();
        else
            USBOTGDisableHnp();
    }

    if ((usb_setup_pkt.bFeature == OTG_FEATURE_A_HNP_SUPPORT)&&
        (usb_setup_pkt.Recipient == RCPT_DEV))
    {
        usb_in_pipe[0].info.bits.busy = 1;
        if (usb_setup_pkt.bRequest == SET_FEATURE)
            USBOTGEnableSupportHnp();
        else
            USBOTGDisableSupportHnp();
    }


    if ((usb_setup_pkt.bFeature == OTG_FEATURE_A_ALT_HNP_SUPPORT)&&
        (usb_setup_pkt.Recipient == RCPT_DEV))
    {
        usb_in_pipe[0].info.bits.busy = 1;
        if (usb_setup_pkt.bRequest == SET_FEATURE)
            USBOTGEnableAltHnp();
        else
            USBOTGDisableAltHnp();
    }
#endif
    if ((usb_setup_pkt.bFeature == DEVICE_REMOTE_WAKEUP)&&
       (usb_setup_pkt.Recipient == RCPT_DEV))
    {
        usb_in_pipe[0].info.bits.busy = 1;
        if (usb_setup_pkt.bRequest == SET_FEATURE)
            usb_remote_wakeup = 1;
        else
            usb_remote_wakeup = 0;
    }

    if ((usb_setup_pkt.bFeature == ENDPOINT_HALT)&&
       (usb_setup_pkt.Recipient == RCPT_EP)&&
       (usb_setup_pkt.EPNum != 0))
    {
        usb_in_pipe[0].info.bits.busy = 1;
        /* Must do address calculation here */

        if (usb_setup_pkt.EPDir == 0)
        {
            p = (BDT_ENTRY*)pBDTEntryOut[usb_setup_pkt.EPNum];
        } else {
            p = (BDT_ENTRY*)pBDTEntryIn[usb_setup_pkt.EPNum];
        }

		//if it was a SET_FEATURE request
        if (usb_setup_pkt.bRequest == SET_FEATURE)
        {
            // Then STALL the endpoint
            p->STAT.Val = _USIE|_BSTALL;
        } else {
            // If it was not a SET_FEATURE
            // point to the appropriate UEP register
            pUEP = (unsigned int*) &U1EP0;
            pUEP += usb_setup_pkt.EPNum * 4;

	    //Clear the STALL bit in the UEP register
            *pUEP &= ~UEP_STALL;

            if (usb_setup_pkt.EPDir == 1) // IN
            {
		// If the endpoint is an IN endpoint then we
		// need to return it to the CPU and reset the
		// DTS bit so that the next transfer is correct
#if (USB_PING_PONG_MODE == USB_PING_PONG__ALL_BUT_EP0) || \
    (USB_PING_PONG_MODE == USB_PING_PONG__FULL_PING_PONG)
                p->STAT.Val = _UCPU | _DAT0;
                // toggle over the to the next buffer
                *(unsigned char*)&p ^= USB_NEXT_PING_PONG;
                p->STAT.Val = _UCPU | _DAT1;
#else
                p->STAT.Val = _UCPU | _DAT1;
#endif
            } else {
		// If the endpoint was an OUT endpoint then we
		// need to give control of the endpoint back to
		// the SIE so that the function driver can
		// receive the data as they expected.  Also need
		// to set the DTS bit so the next packet will be
		// correct
#if (USB_PING_PONG_MODE == USB_PING_PONG__ALL_BUT_EP0) || \
    (USB_PING_PONG_MODE == USB_PING_PONG__FULL_PING_PONG)
                p->STAT.Val = _USIE|_DAT0|_DTSEN;
                //toggle over the to the next buffer
                *(unsigned char*)&p ^= USB_NEXT_PING_PONG;
                p->STAT.Val = _USIE|_DAT1|_DTSEN;
#else
                p->STAT.Val = _USIE|_DAT1|_DTSEN;
#endif
            }
        }
    }
}

/*
 * This routine handles the standard GET_DESCRIPTOR request.
 */
void usb_std_get_dsc_handler(void)
{
    if (usb_setup_pkt.bmRequestType == 0x80)
    {
        usb_in_pipe[0].info.Val = USB_INPIPES_ROM | USB_INPIPES_BUSY | USB_INPIPES_INCLUDE_ZERO;

        switch(usb_setup_pkt.bDescriptorType)
        {
            case USB_DESCRIPTOR_DEVICE:
                #if !defined(USB_USER_DEVICE_DESCRIPTOR)
                    usb_in_pipe[0].pSrc.bRom = (const unsigned char*)&usb_device;
                #else
                    usb_in_pipe[0].pSrc.bRom = (const unsigned char*)USB_USER_DEVICE_DESCRIPTOR;
                #endif
                usb_in_pipe[0].wCount = sizeof(usb_device);
                break;
            case USB_DESCRIPTOR_CONFIGURATION:
                #if !defined(USB_USER_CONFIG_DESCRIPTOR)
                    usb_in_pipe[0].pSrc.bRom = usb_config [usb_setup_pkt.bDscIndex];
                #else
                    usb_in_pipe[0].pSrc.bRom = *(USB_USER_CONFIG_DESCRIPTOR + usb_setup_pkt.bDscIndex);
                #endif
                usb_in_pipe[0].wCount = *(usb_in_pipe[0].pSrc.wRom+1);                // Set data count
                break;
            case USB_DESCRIPTOR_STRING:
#if defined(USB_NUM_STRING_DESCRIPTORS)
		if (usb_setup_pkt.bDscIndex < USB_NUM_STRING_DESCRIPTORS)
#else
                if (1)
#endif
                {
                    //Get a pointer to the String descriptor requested
                    usb_in_pipe[0].pSrc.bRom = usb_string [usb_setup_pkt.bDscIndex];
                    // Set data count
                    usb_in_pipe[0].wCount = *usb_in_pipe[0].pSrc.bRom;
                }
                else
                {
                    usb_in_pipe[0].info.Val = 0;
                }
                break;
            default:
                usb_in_pipe[0].info.Val = 0;
                break;
        }//end switch
    }//end if
}//end usb_std_get_dsc_handler

/*
 * This routine handles the standard GET_STATUS request
 */
void usb_std_get_status_handler(void)
{
    ctrl_trf_data[0] = 0;                 // Initialize content
    ctrl_trf_data[1] = 0;

    switch(usb_setup_pkt.Recipient)
    {
        case RCPT_DEV:
            usb_in_pipe[0].info.bits.busy = 1;
            /*
             * [0]: bit0: Self-Powered Status [0] Bus-Powered [1] Self-Powered
             *      bit1: RemoteWakeup        [0] Disabled    [1] Enabled
             */
	    ctrl_trf_data[0] |= 1;		// self powered

