RetroBSD/retrobsd-early/sys/pic32/usb_device.c
            if (usb_remote_wakeup == 1) {
                ctrl_trf_data[0] |= 2;
            }
            break;
        case RCPT_INTF:
            usb_in_pipe[0].info.bits.busy = 1;  // No data to update
            break;
        case RCPT_EP:
            usb_in_pipe[0].info.bits.busy = 1;
            /*
             * [0]: bit0: Halt Status [0] Not Halted [1] Halted
             */
            {
                BDT_ENTRY *p;

                if (usb_setup_pkt.EPDir == 0)
                {
                    p = (BDT_ENTRY*)pBDTEntryOut[usb_setup_pkt.EPNum];
                } else {
                    p = (BDT_ENTRY*)pBDTEntryIn[usb_setup_pkt.EPNum];
                }

                if (p->STAT.Val & _BSTALL)      // Use _BSTALL as a bit mask
                    ctrl_trf_data[0] = 1;       // Set bit0
                break;
            }
    }//end switch

    if (usb_in_pipe[0].info.bits.busy == 1)
    {
        usb_in_pipe[0].pSrc.bRam = (unsigned char*) &ctrl_trf_data; // Set Source
        usb_in_pipe[0].info.bits.ctrl_trf_mem = _RAM;               // Set memory type
        usb_in_pipe[0].wCount &= ~0xff;
        usb_in_pipe[0].wCount |= 2;                                 // Set data count
    }
}

/*
 * This routine wrap up the ramaining tasks in servicing
 * a Setup Request. Its main task is to set the endpoint
 * controls appropriately for a given situation. See code
 * below.
 * There are three main scenarios:
 * a) There was no handler for the Request, in this case
 *    a STALL should be sent out.
 * b) The host has requested a read control transfer,
 *    endpoints are required to be setup in a specific way.
 * c) The host has requested a write control transfer, or
 *    a control data stage is not required, endpoints are
 *    required to be setup in a specific way.
 *
 * Packet processing is resumed by clearing PKTDIS bit.
 */
void usb_ctrl_ep_service_complete(void)
{
    /*
     * PKTDIS bit is set when a Setup Transaction is received.
     * Clear to resume packet processing.
     */
    U1CON &= ~PIC32_U1CON_PKTDIS;

    if (usb_in_pipe[0].info.bits.busy == 0)
    {
        if (usb_out_pipe[0].info.bits.busy == 1)
        {
            control_transfer_state = CTRL_TRF_RX;
            /*
             * Control Write:
             * <SETUP[0]><OUT[1]><OUT[0]>...<IN[1]> | <SETUP[0]>
             *
             * 1. Prepare IN EP to respond to early termination
             *
             *    This is the same as a Zero Length Packet Response
             *    for control transfer without a data stage
             */
            pBDTEntryIn[0]->CNT = 0;
            pBDTEntryIn[0]->STAT.Val = _USIE|_DAT1|_DTSEN;

            /*
             * 2. Prepare OUT EP to receive data.
             */
            pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
            pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress (&ctrl_trf_data);
            pBDTEntryEP0OutNext->STAT.Val = _USIE|_DAT1|_DTSEN;
        } else {
            /*
             * If no one knows how to service this request then stall.
             * Must also prepare EP0 to receive the next SETUP transaction.
             */
            pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
            pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&usb_setup_pkt);

            /* v2b fix */
            pBDTEntryEP0OutNext->STAT.Val = _USIE|_DAT0|_DTSEN|_BSTALL;
            pBDTEntryIn[0]->STAT.Val = _USIE|_BSTALL;
        }
    } else {
        // A module has claimed ownership of the control transfer session.
        if (usb_out_pipe[0].info.bits.busy == 0)
        {
            if (usb_setup_pkt.DataDir == DEV_TO_HOST)
            {
                if (usb_setup_pkt.wLength < usb_in_pipe[0].wCount)
                {
                        usb_in_pipe[0].wCount = usb_setup_pkt.wLength;
                }
                usb_ctrl_trf_tx_service();
                control_transfer_state = CTRL_TRF_TX;
                /*
                 * Control Read:
                 * <SETUP[0]><IN[1]><IN[0]>...<OUT[1]> | <SETUP[0]>
                 * 1. Prepare OUT EP to respond to early termination
                 *
                 * NOTE:
                 * If something went wrong during the control transfer,
                 * the last status stage may not be sent by the host.
                 * When this happens, two different things could happen
                 * depending on the host.
                 * a) The host could send out a RESET.
                 * b) The host could send out a new SETUP transaction
                 *    without sending a RESET first.
                 * To properly handle case (b), the OUT EP must be setup
                 * to receive either a zero length OUT transaction, or a
                 * new SETUP transaction.
                 *
                 * Furthermore, the Cnt byte should be set to prepare for
                 * the SETUP data (8-byte or more), and the buffer address
                 * should be pointed to usb_setup_pkt.
                 */
                pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
                pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&usb_setup_pkt);
                pBDTEntryEP0OutNext->STAT.Val = _USIE;           // Note: DTSEN is 0!

                pBDTEntryEP0OutCurrent->CNT = USB_EP0_BUFF_SIZE;
                pBDTEntryEP0OutCurrent->ADR = (unsigned char*)&usb_setup_pkt;
                pBDTEntryEP0OutCurrent->STAT.Val = _USIE;           // Note: DTSEN is 0!

                /*
                 * 2. Prepare IN EP to transfer data, Cnt should have
                 *    been initialized by responsible request owner.
                 */
                pBDTEntryIn[0]->ADR = ConvertToPhysicalAddress (&ctrl_trf_data);
                pBDTEntryIn[0]->STAT.Val = _USIE|_DAT1|_DTSEN;

            } else {  // (usb_setup_pkt.DataDir == HOST_TO_DEVICE)

                control_transfer_state = CTRL_TRF_RX;
                /*
                 * Control Write:
                 * <SETUP[0]><OUT[1]><OUT[0]>...<IN[1]> | <SETUP[0]>
                 *
                 * 1. Prepare IN EP to respond to early termination
                 *
                 *    This is the same as a Zero Length Packet Response
                 *    for control transfer without a data stage
                 */
                pBDTEntryIn[0]->CNT = 0;
                pBDTEntryIn[0]->STAT.Val = _USIE|_DAT1|_DTSEN;

