RetroBSD/retrobsd-early/sys/pic32/usb_device.c
                /*
                 * 2. Prepare OUT EP to receive data.
                 */
                pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
                pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress (&ctrl_trf_data);
                pBDTEntryEP0OutNext->STAT.Val = _USIE|_DAT1|_DTSEN;
            }
        }
    }
}


/*
 * This routine should be called from only two places.
 * One from usb_ctrl_ep_service_complete() and one from
 * usb_ctrl_trf_in_handler(). It takes care of managing a
 * transfer over multiple USB transactions.
 *
 * This routine works with isochronous endpoint larger than
 * 256 bytes and is shown here as an example of how to deal
 * with BC9 and BC8. In reality, a control endpoint can never
 * be larger than 64 bytes.
 *
 * PreCondition: pSrc, wCount, and usb_stat.ctrl_trf_mem are setup properly.
 */
void usb_ctrl_trf_tx_service(void)
{
    unsigned byteToSend;
    unsigned char *dst;

    /*
     * First, have to figure out how many byte of data to send.
     */
    if (usb_in_pipe[0].wCount < USB_EP0_BUFF_SIZE)
    {
        byteToSend = usb_in_pipe[0].wCount;

        /* v2b fix */
        if (short_packet_status == SHORT_PKT_NOT_USED) {
            short_packet_status = SHORT_PKT_PENDING;

        } else if (short_packet_status == SHORT_PKT_PENDING) {
            short_packet_status = SHORT_PKT_SENT;
        }
        /* end v2b fix for this section */
    }
    else
    {
        byteToSend = USB_EP0_BUFF_SIZE;
    }

    /*
     * Next, load the number of bytes to send to BC9..0 in buffer descriptor
     */
    pBDTEntryIn[0]->CNT = byteToSend;

    /*
     * Subtract the number of bytes just about to be sent from the total.
     */
    usb_in_pipe[0].wCount = usb_in_pipe[0].wCount - byteToSend;

    // Set destination pointer
    dst = (unsigned char*) ctrl_trf_data;

    // Determine type of memory source
    if (usb_in_pipe[0].info.bits.ctrl_trf_mem == USB_INPIPES_ROM)
    {
        while (byteToSend)
        {
            *dst++ = *usb_in_pipe[0].pSrc.bRom++;
            byteToSend--;
        }
    } else { // RAM
        while (byteToSend)
        {
            *dst++ = *usb_in_pipe[0].pSrc.bRam++;
            byteToSend--;
        }
    }
}

/*
 * *** This routine is only partially complete. Check for
 * new version of the firmware.
 *
 * PreCondition: pDst and wCount are setup properly.
 *               pSrc is always &ctrl_trf_data
 *               usb_stat.ctrl_trf_mem is always _RAM.
 *               wCount should be set to 0 at the start of each control transfer.
 */
void usb_ctrl_trf_rx_service(void)
{
    unsigned char byteToRead;
    unsigned char i;

    byteToRead = pBDTEntryEP0OutCurrent->CNT;

    /*
     * Accumulate total number of bytes read
     */
    if (byteToRead > usb_out_pipe[0].wCount)
    {
        byteToRead = usb_out_pipe[0].wCount;
    } else {
        usb_out_pipe[0].wCount = usb_out_pipe[0].wCount - byteToRead;
    }

    for(i=0;i<byteToRead;i++)
    {
        *usb_out_pipe[0].pDst.bRam++ = ctrl_trf_data[i];
    }//end while(byteToRead)

    //If there is more data to read
    if (usb_out_pipe[0].wCount > 0)
    {
        /*
         * Don't have to worry about overwriting _KEEP bit
         * because if _KEEP was set, TRNIF would not have been
         * generated in the first place.
         */
        pBDTEntryEP0OutNext->CNT = USB_EP0_BUFF_SIZE;
        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress (&ctrl_trf_data);
        if (pBDTEntryEP0OutCurrent->STAT.DTS == 0)
        {
            pBDTEntryEP0OutNext->STAT.Val = _USIE|_DAT1|_DTSEN;
        } else {
            pBDTEntryEP0OutNext->STAT.Val = _USIE|_DAT0|_DTSEN;
        }
    } else {
        pBDTEntryEP0OutNext->ADR = ConvertToPhysicalAddress(&usb_setup_pkt);
        if (usb_out_pipe[0].pFunc != 0) {
            usb_out_pipe[0].pFunc();
        }
        usb_out_pipe[0].info.bits.busy = 0;
    }

    // reset ep0Bo.Cnt to USB_EP0_BUFF_SIZE

}//end usb_ctrl_trf_rx_service

/*
 * This routine first disables all endpoints by
 * clearing UEP registers. It then configures
 * (initializes) endpoints by calling the callback
 * function usbcb_init_ep().
 */
void usb_std_set_cfg_handler(void)
{
    // This will generate a zero length packet
    usb_in_pipe[0].info.bits.busy = 1;

    // disable all endpoints except endpoint 0
    bzero((void*) &U1EP1, USB_MAX_EP_NUMBER - 1);

    // clear the alternate interface settings
    bzero((void*) &usb_alternate_interface, USB_MAX_NUM_INT);

    // set the current configuration
    usb_active_configuration = usb_setup_pkt.bConfigurationValue;

    // if the configuration value == 0
    if (usb_setup_pkt.bConfigurationValue == 0)
    {
        // Go back to the addressed state
        usb_device_state = ADDRESS_STATE;
    } else {
        // Otherwise go to the configured state
        usb_device_state = CONFIGURED_STATE;

        // initialize the required endpoints
        usb_init_ep ((const unsigned char*) usb_config [usb_active_configuration - 1]);
        usbcb_init_ep();
    }
}

/*
 * This function will configure the specified endpoint.
 *
 * Input: unsigned char EPNum - the endpoint to be configured
 *        unsigned char direction - the direction to be configured
 */
void usb_configure_endpoint (unsigned char EPNum, unsigned char direction)
{
    volatile BDT_ENTRY* handle;

    handle = (volatile BDT_ENTRY*) &usb_buffer[EP0_OUT_EVEN];
    handle += BD(EPNum,direction,0)/sizeof(BDT_ENTRY);

    handle->STAT.UOWN = 0;

    if (direction == 0)
    {
        pBDTEntryOut[EPNum] = handle;
    } else {
        pBDTEntryIn[EPNum] = handle;
    }

#if (USB_PING_PONG_MODE == USB_PING_PONG__FULL_PING_PONG)
    handle->STAT.DTS = 0;
    (handle+1)->STAT.DTS = 1;
#elif (USB_PING_PONG_MODE == USB_PING_PONG__NO_PING_PONG)
    //Set DTS to one because the first thing we will do
    //when transmitting is toggle the bit
    handle->STAT.DTS = 1;
#elif (USB_PING_PONG_MODE == USB_PING_PONG__EP0_OUT_ONLY)
    if (EPNum != 0)
    {
        handle->STAT.DTS = 1;
    }
#elif (USB_PING_PONG_MODE == USB_PING_PONG__ALL_BUT_EP0)
    if (EPNum != 0)
    {
        handle->STAT.DTS = 0;
        (handle+1)->STAT.DTS = 1;
    }
#endif
}

